Tekla Open API Reference for Tekla Structures 2025
TeklaDrawingColor Constructor (DrawingHatchColors)
 Construct a TeklaDrawingColor instance by passing in a Tekla standard color hatch enum value. Use only for hatches.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TeklaDrawingColor(
	DrawingHatchColors ColorEnum
)
Public Sub New (
	ColorEnum As DrawingHatchColors
)
Parameters
ColorEnum
Type: Tekla.Structures.Drawing.DrawingHatchColors
Color as DrawingHatchColors
See Also
Reference
TeklaDrawingColor Structure
TeklaDrawingColor Overload
Tekla.Structures.Drawing Namespace